Repository: magi1125/inclusive-design-pattern
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: This results in a ragged right-hand side to your paragraphs, but users won’t care.
ja: この結果、パラグラフの右側は不揃いになりますが、ユーザーは気にしないでしょう。

source: This serves as an important reminder that even when you’re designing a highly tactile and dynamic interface, you are still really just putting content into a browser window.
ja: このことは、立体的で動きのあるインターフェイスをデザインするときでも、結局はコンテンツをブラウザウィンドウの中に入れているのだという事実を思い出させてくれます。

source: This would produce the following, corrected outline:
ja: こうすると以下のようなアウトラインが生成されます。

source: Those that don’t support it provide a less informative experience, but not a broken one.
ja: サポートしていない組み合わせでは、得られる情報量は少なくなりますが、破綻するわけではありません。

source: Though frequently omitted, declaring a language for a web page could scarcely be more important.
ja: しばしば省略されますが、Webページの言語を明示することは、それなりに重要です。

source: Though it can be made to look visually compelling either way, it is therefore important not to open an article with its publish date, but with its heading.
ja: 視覚的には無理やり順番を変えて見せることもできますが、上記の理由から、記事の先頭を公開日ではなく、見出しで始めることが大切です。

source: Three columns of justified text with two instances of large word spaces highlighted.
ja: 均等割り付けされた3段組みのテキストの中で、単語間のスペースが大きい2箇所がハイライトされている。

source: Three nested boxes representing a section/subsection structure.
ja: セクション/サブセクション構造を示す、ネストされた3つのボックス。

source: Throughout this book you’ll hear a lot about accessible names.
ja: 本書にはアクセシブルな名前 (name)の話がたびたび出てきます。

source: Time is a luxury we often can’t afford on client projects — which is why client work sometimes gets finished, I suppose.
ja: クライアントから依頼されたプロジェクトでは、贅沢に時間を掛ける余裕はない場合が多い ――時にはこの理由で、クライアントワークが打ち切られることもあるでしょう。

source: To achieve inclusive design you should act as a facilitator, allowing users to configure the way they view and interact with the content you provide them.
ja: インクルーシブデザインを実現するためには、デザイナーは世話役に徹し、提供するコンテンツの表示やインタラクションをユーザーが設定することを許すべきです。

source: To be clear, then, the first of what follows is unacceptable; the second is correct.
ja: わかりやすい例をお見せしましょう。1つめは不適正な例、2つめは正しい例です。

source: To create a subsection within the article, use .
ja: 記事内にサブセクションを作成するには、を使用します。

source: To help me stay focused on the true task at hand, I have a points system.
ja: 目の前の重要な課題に集中するために、私は課題に点数をつけるようにしています。

source: To make matters worse, JavaScript polyfills9 for hyphenation tend to be extremely weighty because they must refer to a large library of agreed hyphenation patterns.
ja: さらに悪いことに、ハイフネーションを行うJavaScriptのポリフィル（脚注23）は、膨大なハイフネーションパターンの定義を参照する必要があるため、極度に重くなりがちです。

source: To make skip links available to keyboard users, we should bring them into view on focus:
ja: キーボードユーザーがスキップリンクを利用できるようにするため、以下のようにして、フォーカス時に表示されるようにしましょう。

source: To make sure font-size, padding and margin all resize proportionately, each should be set using the relative units rem, em or ch.
ja: また、ユーザーが文字サイズを変更した際、font-size、padding、marginが協調して変化するように、それぞれの値を相対単位のremやem、chなどで設定する必要があります。

source: To mitigate this undesired effect, your best strategy is to choose fallback system fonts with intrinsic dimensions (metrics) which are similar to the web font.
ja: この望ましくない現象を軽減する一番の方法は、Webフォントに近い基本寸法（メトリクス）のフォールバックシステムフォントを選択することです。

source: Translated, the selector reads, “Links with href values that start with http but do not contain the string heydonworks.com.”
ja: 説明すると、このセレクタは「hrefの値がhttpで始まり、heydonworks.comという文字列を含まないリンク」と言っています。

source: Try to think in terms of user experience when choosing semantic elements.
ja: セマンティックな要素を選ぶときは、ユーザー体験の観点から考えるようにしましょう。

source: Two Venn diagrams.
ja: 2つのベン図。

source: Two paragraphs.
ja: 2つのパラグラフ。

source: Typesetting
ja: 組版

source: Under all other circumstances we’ll be exploring the possibilities offered by standard web technologies like HTML, CSS, JavaScript and SVG.
ja: あらゆる状況を想定して、HTML、CSS、JavaScript、SVGといったWeb標準技術の可能性を探りましょう。

source: Unfortunately, CSS hyphenation, available via the hyphens8 property, is poorly implemented across browsers.
ja: 残念ながら、hyphens（脚注22）で指定できるはずのCSSのハイフネーションの仕組みは、ブラウザの実装がかなり貧弱な状況です。

source: Universally implemented and semantic though it is, there’s compelling evidence that you should avoid using the <select> element wherever possible.
ja: この要素は広く実装されておりセマンティックでもありますが、可能な限り<select>要素の使用を避けるべき強力な根拠があります。

source: Unless your superpower is prescience and you can anticipate the device setup of each and every one of your users, this is the only way to go.
ja: あなたに予知能力があって、全てのユーザーの端末の設定を予測できるのでない限り、これが唯一の方法です。

source: Unlike the <main> element, <article> is not a landmark, so few screen readers provide it as a navigational tool.
ja: <main>要素とは異なり、<article>はランドマークではないため、ナビゲーション機能を提供しているスクリーンリーダーはほとんどありません。

source: Use them as an early warning system to highlight potential issues, and test with real users as well.
ja: 潜在的な問題をあぶりだす早期警戒システムとして利用した上で、実際のユーザーでもテストするようにしてください。

source: Using display: none;, visibility: hidden;, height: 0; or width: 0; wouldn’t work — it would make the span unavailable both visually and aurally.
ja: display: none;、visibility: hidden;、height: 0;、width: 0;を使ってもうまく機能しません――視覚と聴覚の両方でspanが利用できなくなります。

source: Very difficult to read.
ja: 非常に読みにくい。

source: Very easy to read.
ja: 非常に読みやすい。

source: Viewport Units
ja: ビューポートを基準とする単位

source: Viewport units present the opportunity to set text that scales with the height (vh) or width (vw) of the viewport.
ja: ビューポートの単位を使えば、ビューポートの高さ（vh）と幅（vw）に合わせてテキストのサイズを調整できます。

source: Visually, the role of the subtitle would presumably be indicated by its styling.
ja: 視覚的には、それがサブタイトルの役割を果たしているということは、おそらくスタイルで表現されていることでしょう。

source: We can strengthen and simultaneously normalize the appearance of focus styles for our paragraph links across browsers by using a background-color solution.
ja: background-colorを使用することで、パラグラフのリンクのフォーカススタイルを強調すると同時に、各ブラウザでの見た目をそろえることができます。

source: Web fonts are typically large assets which should be treated as an enhancement.
ja: Webフォントは一般的に大きいアセットなので、エンハンスメントで処理すべきです。

source: Web pages behave like this without author CSS, and should continue to respect this fundamental behavior where CSS is included.
ja: 著者側のCSSがなければ、Webページはこのようにふるまいます。CSSを含める場合でも、この基本的なふるまいを尊重すべきでしょう。

source: Well, there’s more that goes into humble paragraph text design than perhaps you first imagined.
ja: 地味なパラグラフテキストのデザインには、皆さんが最初にイメージしていたよりも、おそらくたくさんのことが含まれています。

source: What makes things hard is that, unlike dealing in accessible interaction states or color contrast levels, accessible wording is not easy to measure.
ja: 難しいのは、アクセシブルなインタラクションの状態や色のコントラストといった対応とは異なり、アクセシブルな言葉遣いは簡単には評価できないということです。

source: What we get is, in fact, a completely different user.
ja: 実際に出会うユーザーとはまったく異なります。

source: What’s less known is that very high contrast can actually diminish readability for some users.
ja: あまり知られていませんが、コントラストが非常に高い場合も、一部のユーザーにとって読みにくくなります。

source: When a keyboard user enters a new page, the document itself will be the first thing to receive focus.
ja: キーボードユーザーが新しいページに移動すると、まずそのドキュメント自体がフォーカスを受け取ります。

source: When a pixel-based line height is used, the following is the result:
ja: 行の高さをピクセルベースで指定していた場合、結果は以下のようになります。

source: When a site like smashingmagazine.com13 sends prerendered content to the client, I can print that content to my console using the curl command.
ja: 例えばsmashingmagazine.com（脚注47）などのWebサイトは、レンダリング済みのコンテンツをクライアントに送信しているため、curlコマンドを使用することでコンテンツをコンソールに表示できます。

source: When content is enlarged, any elements stuck to a certain part of the screen are liable to become blind spots.
ja: コンテンツを拡大したとき、画面の特定の場所に固定された要素は、他のコンテンツを覆い隠して読めなくしてしまう傾向があります。

source: When including fonts using Google Fonts8, you can append a text parameter to the URI listing just the characters you need.
ja: Google Fonts（脚注11）を使用する場合は、URIにtextパラメータを付けて、必要な文字のリストを指定できます。

source: When incorporating complex grid systems, we tend to rely heavily on <div>-based scaffolding.
ja: 複雑なグリッドシステムを組み込むとき、私たちは<div>ベースの枠組みに大きく依存しがちです。

source: When it comes to structure, depth is just as important as source order.
ja: 構造に関して、ソースの順序と同じくらい重要なのが階層の深さです。

source: When linking to an external resource on a separate domain, it’s polite to inform the user that following the link will take them out of the current context.
ja: 別のドメインにある外部リソースにリンクする場合、そのリンクをたどると現在のコンテキストから外れることをユーザーに伝えた方が親切です。

source: When the reader adjusts something, there’s simply less to break as a result.
ja: 読者が何らかの調整を行った場合でも、破綻することが少なくなります。

source: Where content is subject to a lot of change as a result of user interaction, this approach enables an immediacy not possible when making round-trips to the server.
ja: インタラクションの結果としてコンテンツに大きな変化が生じる場合でも、このアプローチならばサーバーと何度もやり取りをせずに済み、即座に実現することができます。

source: Where everything is set proportionately, whole pages can be scaled simply by adjusting the root font size, as in the media query that follows.
ja: すべてを相対的に設定しておけば、ルートのフォントサイズを調整するだけで、ページ全体のサイズを簡単に調整できます。以下のメディアクエリの例をご覧ください。

source: Where it is not recognized, browsers fall back to the user agent’s default.
ja: この指定が認識できない場合、ブラウザはユーザーエージェントのデフォルトにフォールバックします。

source: Where possible, integrated JavaScript widgets degrade into well-structured static content or interactive form elements, meaning users without JavaScript or CSS — temporarily or otherwise — can traverse and use content.
ja: 可能であれば、統合されたJavaScriptウィジェットを、きちんと構造化された静的なコンテンツとインタラクティブなフォーム要素に分解します。そうすることで、JavaScriptやCSSを――一時的に、あるいは常時――利用しないユーザーでも、コンテンツをたどったり利用したりできるようになります。

source: Where’s the second nesting level?
ja: 2番目のネストレベルはどこに？

source: Whether JavaScript is available or not, semantic HTML ensures an inclusive experience for assistive technology users and makes interaction behavior more predictable and efficient.
ja: JavaScriptが使えるかどうかに関係なく、セマンティックHTMLは支援技術のユーザーにインクルーシブな体験を保証し、インタラクションの動作をより予測可能で効率的なものにします。

source: Whether your web page is an old-school static resource or a single-page app, it is unavoidably a document.
ja: 昔ながらの静的なリソースであれ、シングルページアプリケーションであれ、Webページがドキュメントであることは間違いありません。

source: While it’s true the element <main> itself provides idiosyncratic behaviors, these benefits can be diminished with improper placement; for example, by using multiple <main> elements on a single page or by using <main> to wrap the entire DOM.
ja: <main>要素そのものが独特な動作を提供しているのは確かですが、これらのメリットは、不適切な配置によって損なわれることもあります。たとえば、単一のページで複数の<main>要素を使ったり、<main>を使用してDOMツリーの大半をラップしたりする使い方です。

source: While other chapters of this book will look into discrete interface patterns — conventions realized as modules or components — it would be foolhardy to not recognize that each of these will ultimately belong to a web document.
ja: この後の章では個々のインターフェイスパターン――モジュールあるいはコンポーネントとして確立された慣習――を詳しく見ていくことになりますが、その前に、それらのパターンが最終的にWebドキュメントに属することを理解しておかなければなりません。

source: While this method eschews having to make structural errors to achieve visual effects, exercise caution: in most cases, an should look like an .
ja: この方法では、見た目のために構造を崩さずに済みますが、注意が必要です。たいていの場合、はらしい見た目にすべきです。

source: Why so many type designers are enamored with pale gray text on a white background, I’ll never know.
ja: なぜこれほど多くのデザイナーが、白の背景上に薄いグレーのテキストを好んで使うのか、私にはわかりません。

source: With custom CSS, we can keep the symbolic role of an underline but implement it better.
ja: カスタムCSSを使用すれば、アンダーラインの象徴的な役割はそのままに、より優れた方法で実装できます。

source: With so many exciting opportunities available to us to build interactive mechanisms, it’s tempting to neglect the design of our body text.
ja: インタラクティブな仕組みを構築するという楽しい機会がたくさんあると、本文テキストのデザインをおろそかにしてしまいがちです。

source: With the above provision in place, when the user hits their Tab key they’ll focus the first interactive element on the page: the skip link.
ja: その状態でユーザーがTabキーを押すと、ページ内の最初のインタラクティブ要素、つまりスキップリンクがフォーカスされます。

source: With this algorithm in place, everything scales incrementally and proportionately relative to the viewport.
ja: このアルゴリズムでは、すべてのテキストがビューポートに対して相対的に拡大縮小していきます。

source: Without a doctype declared, the browser simply doesn’t know how to interpret the content and can regress into a non-compliant and incompatible mode, often called quirks mode1.
ja: DOCTYPEが明確でないと、ブラウザはコンテンツをどう解釈したらよいか分からず、非対応の不適合なモード、いわゆるQuirksモード（脚注4）で表示してしまうことがあります。

source: Writing Paragraphs
ja: パラグラフの記述

source: Yes, please!</h2>
ja: ください！

source: Yet it’s also where we habitually disable users’ ability to zoom content, making experiences, well, less magical.
ja: しかしこのタグは同時に、ユーザーによるコンテンツの拡大縮小を無効にして、魔法のようにユーザー体験を損なうことが少なくありません。

source: Yet not only is a readable web page an inclusive one, there’s also some interactivity to address in the forms of zoom functionality and inline hyperlinks.
ja: また、読みやすければそれだけでインクルーシブだというわけではなく、ズーム機能やインラインハイパーリンクといったインタラクティブな機能についても考える必要があります。

source: You can replace these default styles, but you should never just remove them.
ja: これらのデフォルトのスタイルは置き換えることができますが、単に削除するのは絶対に避けてください。

source: You can take the lessons learned here and apply them within any framework sufficiently flexible to allow you to write and organize good interfaces.
ja: ここで学んだことを生かしながら、十分に柔軟なフレームワークを利用すれば、優れたインターフェイスを記述、編成できます。

source: You can tweak the vertical positioning using background-position, and the thickness using background-size to find the most readable solution for the typeface.
ja: background-positionで垂直位置を調整したり、background-sizeで太さを調整したりして、書体が最も読みやすくなる方法を見つけることができます。

source: You cannot therefore depend on it becoming implemented uniformly or reliably in browsers.
ja: そのため、この要素が各種のブラウザで確実に実装されていることを前提としてはなりません。

source: You could stop there, but the lack of further structural information would produce comprehension issues for a broad range of users.
ja: それで終わりにすることもできますが、構造情報がこれだけでは、多くのユーザーに理解の点で問題が生じます。

source: You just need to address one issue: elements set using viewport units cannot be scaled using full-page zoom.
ja: ただし、1つ注意点があります。ビューポートの単位が指定されている要素は、フルページズームでは拡大縮小されないということです。

source: You may already be accustomed to the convention of setting font size using a percentage, on the root (<html>) element like so:
ja: フォントサイズをパーセンテージ指定する慣習は、もうおなじみかもしれません。ルート（<html>）要素で以下のようにします。

source: You may recall my remark earlier that the browser itself is an interface.
ja: 前述したように、ブラウザ自体もインターフェイスです。

source: You may recall the <main> element from our setup in “The Document.” Every web page should have a <main> element to identify the unique content of that page.
ja: 「ドキュメント全体」で設定した<main>要素を思い出してください。すべてのWebページには、そのページ独自のコンテンツを特定する<main>要素があるべきです。

source: You should always aim to divide your content into digestible chunks.
ja: 理解しやすい塊にコンテンツを分解するよう、常に意識するべきです。

source: Your subsidiary interface should be tolerant of users’ differing setups and configurations.
ja: あなたがデザインするインターフェイスはあくまでブラウザのインターフェイスに付随するものであり、ユーザー側のさまざまな設定や構成に対応できなければなりません。

source: Zoom can be reinstated by entering a viewport unit-based value into a sum with an em-based value.
ja: ズームを再び機能させるには、ビューポートの単位の値にemベースの値を加算するという方法があります。

source: college
ja: 大学生

source: college graduate
ja: 大学卒業

source: “But my audience is young and hip!” I hear you say.
ja: 「でも私のサイトのユーザーは若くて流行に敏感な人たちだから！」と言う人もいるでしょう。

source: “I purchased a mammalian companion of the canine variety” is never better than “I bought a dog.”
ja: 「私はともに過ごすイヌ科の哺乳類を購入した」が「私は犬を買った」に勝ることはありません。

source: “If it’s not curlable, it’s not on the web.” – “js;dr = JavaScript required; Didn’t Read12,” Tantek Çelik
ja: 「curlできなければ、Web上にはない」— タンテック・チェリック「js;dr = JavaScript required; Didn’t Read（脚注47）」

source: “It seems to me that developer ergonomics should be less important than our users’ needs.” – Paul Lewis12
ja: 開発者の作業しやすさより、ユーザーのニーズの方が重要だと私は思う。 ポール・ルイス（Paul Lewis）（脚注15）

source: “The average user is created from the combination of all users.
ja: 「平均的ユーザーは、すべてのユーザーを組み合わせて作られます。
